modm-ext/data.modm.io/docs/svd/header_stm32f750xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="ADC1">
      <name>ADC2</name>
      <description>Analog to Digital Converter</description>
      <baseAddress>0x40012100</baseAddress>
    </peripheral>
    <peripheral derivedFrom="ADC1">
      <name>ADC3</name>
      <description>Analog to Digital Converter</description>
      <baseAddress>0x40012200</baseAddress>
    </peripheral>
    <peripheral>
      <name>ADC</name>
      <baseAddress>0x40012300</baseAddress>
      <interrupt>
        <name>ADC</name>
        <description>ADC1, ADC2 and ADC3 global Interrupts</description>
        <value>18</value>
      </interrupt>
      <registers>
        <register>
          <name>CSR</name>
          <description>ADC Common status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AWD1</name>
              <description>ADC1 Analog watchdog flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOC1</name>
              <description>ADC1 End of conversion</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JEOC1</name>
              <description>ADC1 Injected channel end of conversion</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JSTRT1</name>
              <description>ADC1 Injected channel Start flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STRT1</name>
              <description>ADC1 Regular channel Start flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR1</name>
              <description>ADC1 Overrun flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWD2</name>
              <description>ADC2 Analog watchdog flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOC2</name>
              <description>ADC2 End of conversion</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JEOC2</name>
              <description>ADC2 Injected channel end of conversion</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JSTRT2</name>
              <description>ADC2 Injected channel Start flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STRT2</name>
              <description>ADC2 Regular channel Start flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR2</name>
              <description>ADC2 Overrun flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWD3</name>
              <description>ADC3 Analog watchdog flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOC3</name>
              <description>ADC3 End of conversion</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JEOC3</name>
              <description>ADC3 Injected channel end of conversion</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JSTRT3</name>
              <description>ADC3 Injected channel Start flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STRT3</name>
              <description>ADC3 Regular channel Start flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR3</name>
              <description>ADC3 Overrun flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <description>ADC common control register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MULTI</name>
              <description>MULTI[4:0] bits (Multi-ADC mode selection)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INDEPENDENT</name>
                  <description>ADC dual mode disabled (ADC independent mode)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_REG_SIMULT</name>
                  <description>ADC dual mode enabled: group regular simultaneous</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_REG_INTERL</name>
                  <description>ADC dual mode enabled: Combined group regular interleaved</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_INJ_SIMULT</name>
                  <description>ADC dual mode enabled: group injected simultaneous</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_INJ_ALTERN</name>
                  <description>ADC dual mode enabled: group injected alternate trigger. Works only with external triggers (not internal SW start)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_REG_SIM_INJ_SIM</name>
                  <description>ADC dual mode enabled: Combined group regular simultaneous + group injected simultaneous</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_REG_SIM_INJ_ALT</name>
                  <description>ADC dual mode enabled: Combined group regular simultaneous + group injected alternate trigger</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_REG_INT_INJ_SIM</name>
                  <description>ADC dual mode enabled: Combined group regular interleaved + group injected simultaneous</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIPLE_REG_SIM_INJ_SIM</name>
                  <description>ADC triple mode enabled: Combined group regular simultaneous + group injected simultaneous</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIPLE_REG_SIM_INJ_ALT</name>
                  <description>ADC triple mode enabled: Combined group regular simultaneous + group injected alternate trigger</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIPLE_INJ_SIMULT</name>
                  <description>ADC triple mode enabled: group injected simultaneous</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIPLE_REG_SIMULT</name>
                  <description>ADC triple mode enabled: group regular simultaneous</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIPLE_REG_INTERL</name>
                  <description>ADC triple mode enabled: Combined group regular interleaved</description>
                  <value>23</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DELAY</name>
              <description>DELAY[3:0] bits (Delay between 2 sampling phases)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DELAY_5CYCLES</name>
                  <description>ADC multimode delay between two sampling phases: 5 ADC clock cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_6CYCLES</name>
                  <description>ADC multimode delay between two sampling phases: 6 ADC clock cycles</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_7CYCLES</name>
                  <description>ADC multimode delay between two sampling phases: 7 ADC clock cycles</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_8CYCLES</name>
                  <description>ADC multimode delay between two sampling phases: 8 ADC clock cycles</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_9CYCLES</name>
                  <description>ADC multimode delay between two sampling phases: 9 ADC clock cycles</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_10CYCLES</name>
                  <description>ADC multimode delay between two sampling phases: 10 ADC clock cycles</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_11CYCLES</name>
                  <description>ADC multimode delay between two sampling phases: 11 ADC clock cycles</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_12CYCLES</name>
                  <description>ADC multimode delay between two sampling phases: 12 ADC clock cycles</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_13CYCLES</name>
                  <description>ADC multimode delay between two sampling phases: 13 ADC clock cycles</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_14CYCLES</name>
                  <description>ADC multimode delay between two sampling phases: 14 ADC clock cycles</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_15CYCLES</name>
                  <description>ADC multimode delay between two sampling phases: 15 ADC clock cycles</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_16CYCLES</name>
                  <description>ADC multimode delay between two sampling phases: 16 ADC clock cycles</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_17CYCLES</name>
                  <description>ADC multimode delay between two sampling phases: 17 ADC clock cycles</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_18CYCLES</name>
                  <description>ADC multimode delay between two sampling phases: 18 ADC clock cycles</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_19CYCLES</name>
                  <description>ADC multimode delay between two sampling phases: 19 ADC clock cycles</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_20CYCLES</name>
                  <description>ADC multimode delay between two sampling phases: 20 ADC clock cycles</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DDS</name>
              <description>DMA disable selection (Multi-ADC mode)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA</name>
              <description>DMA[1:0] bits (Direct Memory Access mode for multimode)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ADCPRE</name>
              <description>ADCPRE[1:0] bits (ADC prescaler)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>ADC synchronous clock derived from AHB clock with prescaler division by 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>ADC synchronous clock derived from AHB clock with prescaler division by 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV6</name>
                  <description>ADC synchronous clock derived from AHB clock with prescaler division by 6</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>ADC synchronous clock derived from AHB clock with prescaler division by 8</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBATE</name>
              <description>VBAT Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSVREFE</name>
              <description>Temperature Sensor and VREFINT Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CDR</name>
          <description>ADC common regular data register for dual AND triple modes</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA1</name>
              <description>1st data of a pair of regular conversions</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>DATA2</name>
              <description>2nd data of a pair of regular conversions</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
